Revit 2027 API
BuiltInFailures.ExtendedPropertiesLinkFailures.UnsupportedCategory Property
 The dataset contains an unsupported category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnsupportedCategory { get; }
Public Shared ReadOnly Property UnsupportedCategory As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnsupportedCategory {
	FailureDefinitionId^ get ();
}
static member UnsupportedCategory : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ExtendedPropertiesLinkFailures Class
Autodesk.Revit.DB Namespace